# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, DualConv, [128, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, DualConv, [256,  2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, DualConv, [512,  2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, DualConv, [1024, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 3]]  # 9

# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 10], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, VoVGSCSP, [512]]   # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, VoVGSCSP, [256]]   # 19 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P2
  - [-1, 3, VoVGSCSP, [128]]  # 22 (P2/4-xsmall)

  - [-1, 1, GSConv, [128, 3, 2]]
  - [[-1, 19], 1, Concat, [1]]  # cat head P3
  - [-1, 3, VoVGSCSP, [256]]  # 25 (P3/8-small)

  - [-1, 1, GSConv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]  # cat head P4
  - [-1, 3, VoVGSCSP, [512]]  # 28 (P4/16-medium)

  - [-1, 1, GSConv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P5
  - [-1, 3, VoVGSCSP, [1024]]  # 31 (P5/32-large)

  - [[22, 25, 28, 31], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)